Repository: common-repository/wikilookup
Catalog: languages/wikilookup-*.po
Languages: he

source: Settings
he: הגדרות

source: Invalid nonce specified
he: התקבל סימון חד פעמי לא חוקי

source: Error
he: שגיאה

source: You do not have permissions to manage these settings.
he: אין ברשותך הרשאות לנהל הגדרות אלה.

source: Settings saved successfully
he: ההגדרות נשמרו בהצלחה

source: There was a problem saving settings.
he: אירעה בעיה בשמירת הגדרות.

source: Popup Preview
he: תצוגה מקדימה של החלונות הקופצים

source: Card Preview
he: תצוגה מקדימה של הכרטיס

source: General display settings
he: הגדרות תצוגה כלליות

source: Use dark theme
he: תשתמש בערכת צבעים כהה

source: Popup width
he: רוחב החלונות הקופצים

source: The popup is best viewed at 650px and above.
he: החלונות הקופצים נצפים בצורה הטובה ביותר בגודל 650 פיקסלים ומעלה

source: Hide images in popups
he: הסתר תמונות בחלונות הקופצים

source: Card width
he: רוחב הכרטיסים

source: Hide images in cards
he: הסתר תמונות בכרטיסים

source: Display Text
he: תצוגת טקסט

source: Text for the "Read more" link
he: טקסט לקישור "קרא עוד"

source: Text for the link to the article history
he: טקסט לקישור להיסטוריית המאמר

source: Text for the pending state
he: טקסט למצב המתנה

source: Text for an error state
he: טקסט למצב שגיאה

source: Welcome to Wikilookup!
he: ברוכים הבאים לויקילוקאפ!

source: This plugin allows you to add popups from <a href="https://www.wikipedia.org/" target="_blank">Wikipedia</a> (and other wikis) into your post content.
he: התוסף מאפשר לך להוסיף חלונות קופצים (פופאפ) <a href="https://www.wikipedia.org/" target="_blank">מויקיפדיה</a> (ואתרי ויקי אחרים) לכתבות הבלוג שלך.

source: There are two ways to use this plugin: A <strong>popup</strong> and a <strong>card</strong> (poster). Both methods have similar configurable parameters, but are being called in different ways.
he: ישנן שתי אפשרויות להשתמש בתוסף: כרטיס, וחלון קופץ (פופאפ). לשתי האפשרויות פרמטרים דומים, אך השימוש בהן שונה.

source: Inserting shortcodes
he: הכנסת קיצורי קוד

source: You can insert popups and cards with <em>shortcodes</em>. These are codes you type into your post as you write. Below is a reference to how to use the shortcodes and what options you can utilize.
he: ניתן להכניס חלונות קופצים (פופאפ) וכרטיסים באמצעות "קיצורי קוד". אלו הם קיצורים המאפשרים לך לסמן את המילים הרצויות בזמן כתיבת הפוסט.

source: Popup options
he: אפשרויות החלונות הקופצים

source: You can use multiple combinations of the examples below.
he: ניתן להשתמש במספר שילובים של האפשרויות המוצעות

source: Shortcode
he: קוד קצר

source: Popup trigger
he: המילה המפעילה את החלון הקופץ

source: Popup article topic
he: תוכן הערך המוצג

source: Description
he: תיאור

source: Creates a popup that shows the article from your default wiki about "Mountains"
he: יוצר חלון קופץ המראה מידע מהערך "Mountains" שמגיע מהויקי המוגדרת כברירת מחדל

source: Creates a popup that shows the article from your default wiki about "Mountains", but the popup appears over the words "very high hills"
he: יוצר חלון קופץ המראה מידע מהערך "Mountains" שמגיע מהויקי המוגדרת כברירת מחדל, אך החלון קופץ מהמילים "very high hills"

source: Creates a popup that shows the article from the Spanish version of your default wiki about "Montaña"
he: יוצר חלון קופץ המראה מידע מהערך "Montaña" שמגיע מהשפה הספרדית בויקי המוגדרת כברירת מחדל

source: Creates a popup that shows the article about "Picard" that is pulled from the external wiki you named "trek"
he: יוצר חלון קופץ המראה מידע מהערך "Picard" שמגיע מויקי חיצונית המוגדרת בשם "trek"

source: Card options
he: אפשרויות הכרטיס

source: Notice that you do not need to close a <code>[wikicard]</code> shortcode.
he: שימו לב, כרטיסים אינם דורשים סיומת קוד קצר של <code>[wikicard]</code>

source: Card article topic
he: תוכן הערך המוצג

source: Creates a card that shows the article from your default wiki about "Mountains"
he: יוצר כרטיס המראה מידע מהערך "Mountains" שמגיע מהויקי המוגדרת כברירת מחדל

source: Creates a card that shows the article "Montaña" taken from the Spanish version of your default wiki
he: יוצר כרטיס המראה מידע מהערך "Montaña" שמגיע מהשפה הספרדית בויקי המוגדרת כברירת מחדל

source: Creates a card that shows the article about "Picard" that is pulled from the external wiki you named "trek"
he: יוצר כרטיס המראה מידע מהערך "Picard" שמגיע מויקי חיצונית המוגדרת בשם "trek"

source: Creating external sources
he: יצירת מקורות חיצוניים

source: You can add more wikis to your blog and pull information from them by adding "External wikis" in the settings. To do that, go to the Wikilookup settings and choose "External wikis."
he: ניתן להוסיף אתרי ויקי חיצוניים לבלוג ולהראות ערכים מהם באמצעות "אתרי ויקי חיצוניים" בהגדרות. על מנת להוסיף אתרים חיצוניים, יש ללכת להגדרות ויקילוקאפ, ולבחור "אתרי ויקי חיצוניים"

source: You can define any wiki that operates on <a href="https://www.mediawiki.org/" target="_blank">MediaWiki</a>, and provide its api endpoint (usually ending with <code>api.php</code>)
he: ניתן להגדיר כל אתר ויקי חיצוני אשר פועל על <a href="https://www.mediawiki.org/" target="_blank">MediaWiki</a>, ומספק גישה ישירה לAPI (לרוב באמצעות קישור ל<code>api.php</code>)

source: Adding a source allows you to reference it when creating popups and cards, by explicitly adding <code>source="sourceName"</code> in the shortcodes.
he: הוספת אתר ויקי חיצוני מאפשר להפנות אליו כאשר יוצרים חלונות קופצים או כרטיסים, ע"י שימוש בפרמטר <code>source="sourceName"</code> בקוד הקצר. ניתן להגדיר ולהשתמש גם בשמות בעברית.

source: Click here to add external wikis to your blog.
he: לחץ כאן להוספת אתרי ויקי חיצוניים

source: General configuration of the Wikilookup plugin behavior.
he: הגדרות כלליות להתנהגות תוסף ויקילוקאפ.

source: On click
he: בלחיצה

source: On hover
he: בזמן ריחוף

source: Determines how the popup appears.
he: קבע כיצד מופיעים החלונות הקופצים

source: Wikilookup allows you to pull information from other wikis, not just Wikipedia.
he: ויקילוקאפ מאפשר להציג מידע מאתרי ויקי מגוונים, לא רק מויקיפדיה

source: When you edit or write your post, you can reference a source for a specific lookup term by adding <code>source="sourceName"</code>
he: במהלך עריכה או כתיבת הפוסט, ניתן לשייך מקור למונח החיפוש על ידי הוספת <code>source="sourceName"</code>

source: Define the source names below; the sources must be set to a wiki that runs <a href="https://www.mediawiki.org/" target="_blank">MediaWiki</a> with an entrypoint that includes the <code>api.php</code> at the end.
he: ניתן להגדיר מקורות בדף הנוכחי. המקורות חייבים להפנות לויקי המריצה <a href="https://www.mediawiki.org/" target="_blank">MediaWiki</a> עם גישה ישירה דרך <code>api.php</code>

source: Sources
he: מקורות

source: Add new source
he: הוספת מקור חדש

source: Source name
he: שם המקור

source: Source URL
he: קישור המקור

source: Default language code for {{lang}}
he: שפת ברירת מחדל ל {{lang}}

source: Logo URL
he: לוגו למקור

source: Default source
he: מקור ברירת מחדל

source: Remove
he: הסרה

source: Wikilookup
he: ויקילוקאפ

source: Add content from Wikipedia and other wikis into your WordPress blog
he: הוספת תוכן מויקיפדיה ואתרי ויקי נוספים לבלוג הוורדפרס שלך

source: Moriel Schottlender
he: מוריאל שוטלנדר
